#ifndef _TIMER_H
#define _TIMER_H
#include "sys.h"
//////////////////////////////////////////////////////////////////////////////////	 
//定时器2&5初始化、中断		
//********************************************************************************
//修改日期:2017/12/31
//版本：V1.1
//版权所有，盗版必究。
//Copyright(C) 光线量子(北京)智能机器人科技有限公司 
//All rights reserved
//********************************************************************************
////////////////////////////////////////////////////////////////////////////////// 


//dt时间内的左右轮(脉冲)速度,用于里程计计算	
static int PULSE_RIGHT=0,PULSE_LEFT=0;		//dt时间内的左右轮脉冲,用于里程计计算
static u8 odom_cal_status;								//主函数步骤执行标志位

void TIM5_Int_Init(u16 arr,u16 psc);
//void TIM2_Int_Init(u16 arr,u16 psc);

//extern void Get_Pulse(void);	//获取里程计数据

#endif
